snlkuharlocal/src/InformationRegisters/b2b_НастройкиОбменаДанными/b2b_НастройкиОбменаДанными.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>b2b_НастройкиОбменаДанными</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КлючАвторизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ХранитьПодробностиЛогирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Узел</name>
    <type>
      <types>ExchangePlanRef.ОбменССайтом_b2b</types>
    </type>
  </resources>
  <resources>
    <name>МетодAPIВыгрузитьКонтрагентов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МетодAPIВыгрузитьАкции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МетодAPIПроверкаСтатуса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/b2b_ЖурналОшибок/b2b_ЖурналОшибок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>b2b_ЖурналОшибок</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ИнформацияОбОшибке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Результат</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef.Заказ</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/b2b_ЗапросыНаОбновлениеВОчереди/b2b_ЗапросыНаОбновлениеВОчереди.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>b2b_ЗапросыНаОбновлениеВОчереди</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Запрос</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Результат</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Отработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ИдентификаторОчереди</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МассивДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/b2b_ПереданныеАкцииКонтрагентов/b2b_ПереданныеАкцииКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>b2b_ПереданныеАкцииКонтрагентов</name>
  <comment>Последние переданные данные</comment>
  <resources>
    <name>ДанныеБазы</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ПереданныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Изменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Изменения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.УстановкаСкидокПоКонтрагентам</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/ВыгружатьНаСайт/ВыгружатьНаСайт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВыгружатьНаСайт</name>
  <enumValues>
    <name>Да</name>
  </enumValues>
  <enumValues>
    <name>Нет</name>
  </enumValues>
  <enumValues>
    <name>КогдаКак</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/УстановкаСкидокПоКонтрагентам/УстановкаСкидокПоКонтрагентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаСкидокПоКонтрагентам</name>
  <registerRecords>InformationRegister.СкидкиНоменклатурыКонтрагентов</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата2</name>
    <comment>Дата окончания действия прайса</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Контрагенты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Скидки</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЦен</name>
      <type>
        <types>CatalogRef.ТипыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипТовара</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Бренд</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Модель</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаКонечныйПокупатель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/CommonModules/b2b_ОбменДаннымиПоAPI/Module.bsl
#Область СлужебныеПроцедурыИФункции
//test
Функция ПолучитьСтруктуруПодключения() Экспорт
	
	ИдентификаторЗапроса = Строка(Новый УникальныйИдентификатор);
	
	// получить настройки из РС b2b_НастройкиОбменаДанными
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	b2b_НастройкиОбменаДаннымиСрезПоследних.Сервер КАК Сервер,
		|	b2b_НастройкиОбменаДаннымиСрезПоследних.Порт КАК Порт,
		|	b2b_НастройкиОбменаДаннымиСрезПоследних.КлючАвторизации КАК КлючАвторизации,
		|	b2b_НастройкиОбменаДаннымиСрезПоследних.ХранитьПодробностиЛогирования КАК ХранитьПодробностиЛогирования,
		|	b2b_НастройкиОбменаДаннымиСрезПоследних.Узел КАК Узел,
		|	ИСТИНА КАК ЗащищенноеСоединение,
		|	b2b_НастройкиОбменаДаннымиСрезПоследних.МетодAPIВыгрузитьКонтрагентов КАК МетодAPIВыгрузитьКонтрагентов,
		|	b2b_НастройкиОбменаДаннымиСрезПоследних.МетодAPIВыгрузитьАкции КАК МетодAPIВыгрузитьАкции,
		|	b2b_НастройкиОбменаДаннымиСрезПоследних.МетодAPIПроверкаСтатуса КАК МетодAPIПроверкаСтатуса,
		|	"""" КАК Логин,
		|	"""" КАК Пароль
		|ИЗ
		|	РегистрСведений.b2b_НастройкиОбменаДанными.СрезПоследних КАК b2b_НастройкиОбменаДаннымиСрезПоследних";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНастройки = РезультатЗапроса.Выбрать();
	ВыборкаНастройки.Следующий();
	СтруктураПодключения = b2b_ОбменДаннымиПоAPI.ПолучитьСтруктуруИзВыборки(ВыборкаНастройки);
	СтруктураПодключения.Вставить("ИдентификаторЗапроса", ИдентификаторЗапроса); 
	
	Возврат СтруктураПодключения;
	
КонецФункции

Функция ПолучитьСтруктуруИзВыборки(Выборка) Экспорт
	
	Результат = Новый Структура;
	Для каждого Колонка Из Выборка.Владелец().Колонки Цикл
		Результат.Вставить(Колонка.Имя);
	КонецЦикла;
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	Возврат Результат;
	
КонецФункции

Функция HTTPСоединениеДляОбменаДаннымиAPI(СтруктураПодключения) Экспорт
	
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
	Прокси = Новый ИнтернетПрокси(Ложь); 

	Если СтруктураПодключения.Порт = 80 Тогда 		
		СтруктураПодключения.ЗащищенноеСоединение = Ложь; 
	КонецЕсли;
	
	Попытка
		Если СтруктураПодключения.ЗащищенноеСоединение Тогда
			СоединениеHTTP = Новый HTTPСоединение(
				СтруктураПодключения.Сервер, 
				СтруктураПодключения.Порт, 
				СтруктураПодключения.Логин, 
				СтруктураПодключения.Пароль,
				Прокси,
				,
				ЗащищенноеСоединение
			);
		Иначе 
			СоединениеHTTP = Новый HTTPСоединение(
				СтруктураПодключения.Сервер, 
				СтруктураПодключения.Порт, 
				СтруктураПодключения.Логин, 
				СтруктураПодключения.Пароль,
				Прокси
			);
		КонецЕсли;
		
		Возврат СоединениеHTTP; 
		
	Исключение
		ЗаписатьОшибкуОбменДаннымиПоAPI(СтруктураПодключения.ИдентификаторЗапроса, , ОписаниеОшибки()); 
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Процедура ЗаписатьОшибкуОбменДаннымиПоAPI(
	ИдентификаторЗапроса, 
	ИдентификаторКлиента, 
	ИнформацияОбОшибке,
	Результат = Неопределено
	) Экспорт
	
	НоваяЗапись = РегистрыСведений.b2b_ЖурналОшибок.СоздатьМенеджерЗаписи();
	НоваяЗапись.Период = ТекущаяДата();
	НоваяЗапись.ИдентификаторЗапроса = ИдентификаторЗапроса;
	НоваяЗапись.ИдентификаторКлиента = ИдентификаторКлиента;
	НоваяЗапись.ИнформацияОбОшибке = ИнформацияОбОшибке;
	Если Результат <> Неопределено Тогда
		НоваяЗапись.Результат = Новый ХранилищеЗначения(Результат, Новый СжатиеДанных(9));
	КонецЕсли;
	
	Попытка
		НоваяЗапись.Записать();
	Исключение
		ЗаписьЖурналаРегистрации(
			"ОшибкаЗаписиВЖурналОшибок",
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений.b2b_ЖурналОшибок,
			,
			,
		); 
	КонецПопытки; 
	
КонецПроцедуры

Функция СериализоватьВСтрокуJSON(Значение) Экспорт

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON( , Символы.Таб)); 
	ЗаписатьJSON(ЗаписьJSON, Значение);
	Возврат ЗаписьJSON.Закрыть();

КонецФункции

Процедура ПолучитьРезультатОбработкиОчередиНаПортале(СтруктураПодключения) Экспорт
	
	Если Не СтруктураПодключения.Свойство("ТипЗапроса") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТипЗнч(СтруктураПодключения.ТипЗапроса) = Тип("Строка") 
		Или Не ЗначениеЗаполнено(СтруктураПодключения.ТипЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	b2b_ЗапросыНаОбновлениеВОчереди.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
		|	b2b_ЗапросыНаОбновлениеВОчереди.ИдентификаторКлиента КАК ИдентификаторКлиента,
		|	b2b_ЗапросыНаОбновлениеВОчереди.МассивДанных КАК МассивДанных
		|ИЗ
		|	РегистрСведений.b2b_ЗапросыНаОбновлениеВОчереди КАК b2b_ЗапросыНаОбновлениеВОчереди
		|ГДЕ
		|	b2b_ЗапросыНаОбновлениеВОчереди.ИдентификаторКлиента <> """"
		|	И НЕ b2b_ЗапросыНаОбновлениеВОчереди.Отработано
		|	И (ВЫРАЗИТЬ(b2b_ЗапросыНаОбновлениеВОчереди.ТекстОшибки КАК СТРОКА(500))) = """"
		|	И b2b_ЗапросыНаОбновлениеВОчереди.ТипЗапроса = &ТипЗапроса
		|
		|УПОРЯДОЧИТЬ ПО
		|	b2b_ЗапросыНаОбновлениеВОчереди.Период";
	
	Запрос.УстановитьПараметр("ТипЗапроса", СтруктураПодключения.ТипЗапроса);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	РезультатОтправки = Ложь; 
	
	МассивОшибок = Новый массив; 
	
	Пока Выборка.Следующий() Цикл
		ПараметрыДляОтправкиЗапроса = Новый Структура; 
		ПараметрыДляОтправкиЗапроса.Вставить("ИдентификаторКлиента", Выборка.ИдентификаторКлиента);
		ПараметрыДляОтправкиЗапроса.Вставить("ИдентификаторЗапроса", Выборка.ИдентификаторЗапроса);
		ПараметрыДляОтправкиЗапроса.Вставить("ТипЗапроса", "ОтработкаОчереди" + СтруктураПодключения.ТипЗапроса);
		МассивДанныхИзЗапроса = Выборка.МассивДанных.Получить();
		Если МассивДанныхИзЗапроса <> Неопределено Тогда
			МассивКонтрагентов = ЗначениеИзСтрокиВнутр(МассивДанныхИзЗапроса);
		КонецЕсли;
		ПараметрыДляОтправкиЗапроса.Вставить("МассивДанных", МассивКонтрагентов);
		ОтработкаОтправленныхДанныхПоКонтрагентам(
			СтруктураПодключения, 
			ПараметрыДляОтправкиЗапроса, 
			РезультатОтправки, 
			МассивОшибок
		); 
	КонецЦикла;
	
	Если МассивОшибок.Количество() > 0 Тогда
		ТемаПисьма = СтрШаблон("Ошибка отработки очереди  по %1", СтруктураПодключения.ТипЗапроса); 
		ТекстПисьма = МассивОшибок[0] + Символы.ПС + ВРег(СокрЛП(СтрокаСоединенияИнформационнойБазы())); 
		Комментарий = СтрШаблон("Ошибка отправки данных с типом %1", СтруктураПодключения.ТипЗапроса);
		b2b_ОбменЗаявками.СформироватьВнутреннееУведомлениеОбОшибке(ТекстПисьма, ТемаПисьма, Комментарий);	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтработкаОтправленныхДанныхПоКонтрагентам(СтруктураПодключения, ВходныеПараметры, РезультатОтправки, МассивОшибок) Экспорт
	
	СтруктураДанных = b2b_ОбменЗаявками.ЗаполнитьСтруктуруДляПолученияДанныхОчереди(ВходныеПараметры);
	
	СоединениеHTTP = HTTPСоединениеДляОбменаДаннымиAPI(СтруктураПодключения); 
	
	HTTPзапрос = Новый HTTPзапрос();
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/json");
	ЗаголовокHTTP.Вставить("Authorization", СтруктураПодключения.КлючАвторизации);
	
	HTTPЗапрос.Заголовки = ЗаголовокHTTP;
	HTTPзапрос.АдресРесурса = СтруктураПодключения.МетодAPIПроверкаСтатуса;
	
	ТекстЗапроса = b2b_ОбменДаннымиПоAPI.СериализоватьВСтрокуJSON(СтруктураДанных);
	
	HTTPЗапрос.УстановитьТелоИзСтроки(ТекстЗапроса, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	// отправка данных на портал и записываем в журнал: b2b_ЗапросыНаОбновлениеИстория
	Попытка
		Ответ_АПИ = СоединениеHTTP.ОтправитьДляОбработки(HTTPЗапрос);
	Исключение
		// записываем ошибку в лог РС b2b_ЖурналОшибок
        b2b_ОбменДаннымиПоAPI.ЗаписатьОшибкуОбменДаннымиПоAPI(СтруктураПодключения.ИдентификаторЗапроса, , ОписаниеОшибки());
		Возврат;
	КонецПопытки;	
	
	РезультатЧтенияJSON = b2b_ОбменЗаявками.СтруктураJSONЗапроса(Ответ_АПИ); 
	Структура_JSON_Ответ =  РезультатЧтенияJSON.Структура_JSON;
	
	СтрокаJSONОтвета = Ответ_АПИ.ПолучитьТелоКакСтроку(); 
	
	Если Ответ_АПИ.КодСостояния = 200 Тогда
				
		ИдентификаторКлиента = Структура_JSON_Ответ.requestId;
		
		РезультатДанные = Новый Структура("РезультатJson,ИдентификаторОчереди", , "");
		РезультатДанные.РезультатJson = Структура_JSON_Ответ;
		РезультатДанные.ИдентификаторОчереди =  ВходныеПараметры.ИдентификаторКлиента; 
		
		b2b_ОбменЗаявками.ЗаписатьВЖурналЗапросыНаОбновлениеВОчереди(
			Строка(СтруктураПодключения.ИдентификаторЗапроса),
			ИдентификаторКлиента, 
			ТекстЗапроса,
			ВходныеПараметры,
			СтруктураПодключения.ХранитьПодробностиЛогирования
		);

		Если Структура_JSON_Ответ.Свойство("data") Тогда 
			
			b2b_ОбменЗаявками.ЗаписатьВЖурналЗапросыНаОбновлениеВОчередиРезультат(
				Строка(СтруктураПодключения.ИдентификаторЗапроса),
				ИдентификаторКлиента,
				РезультатДанные,
				"",
				,
				,
				СтруктураПодключения.ХранитьПодробностиЛогирования
			);
			
			 Если Структура_JSON_Ответ.data.result = "queued" Тогда     //пока не отработано  
				 
				 РезультатДанныеОчереди = Неопределено;  //не перезаписываем
				 b2b_ОбменЗаявками.ЗаписатьВЖурналЗапросыНаОбновлениеВОчередиРезультат(
				 	ВходныеПараметры.ИдентификаторЗапроса,
					ВходныеПараметры.ИдентификаторКлиента,
					РезультатДанныеОчереди,
					"В обработке"
					,
					,
					,
					СтруктураПодключения.ХранитьПодробностиЛогирования
				 ); 
				 
			 ИначеЕсли 	Структура_JSON_Ответ.data.result = "success" 
				 Или Структура_JSON_Ответ.data.result = "warning" Тогда			 			
				 
				 ОбъектыКСнятиюСРегистрации = ВходныеПараметры.МассивДанных;
				 
				 ТекстОшибокИзСтруктурыОтвета = "";
				  
				 Если Структура_JSON_Ответ.data.result = "warning" Тогда
					 
					 Если Структура_JSON_Ответ.data.Свойство("data") И ТипЗнч(Структура_JSON_Ответ.data.data) = Тип("Массив") Тогда 
						 
						 МассивКодовПриВыгрузкеСОшибкой = Новый Массив;
						 
						 Для Каждого ЭлементМассиваData Из Структура_JSON_Ответ.data.data Цикл
							 Если ЭлементМассиваData.Свойство("errors") И ТипЗнч(ЭлементМассиваData.errors) = Тип("Массив") Тогда 
								 Для Каждого ЭлементМассиваОшибок Из ЭлементМассиваData.errors Цикл
									 // для контрагентов
									 Если ЭлементМассиваОшибок.Свойство("login") Тогда
										 МассивКодовПриВыгрузкеСОшибкой.Добавить(ЭлементМассиваОшибок.login);
										 ТекстОшибокИзСтруктурыОтвета = ТекстОшибокИзСтруктурыОтвета + 
										 СтрШаблон("%1: %2;", ЭлементМассиваОшибок.login, ЭлементМассиваОшибок.error); 
									 КонецЕсли;
									 // для акций
									 Если ЭлементМассиваОшибок.Свойство("code") Тогда
										 МассивКодовПриВыгрузкеСОшибкой.Добавить(ЭлементМассиваОшибок.code);
										 ТекстОшибокИзСтруктурыОтвета = ТекстОшибокИзСтруктурыОтвета + 
										 СтрШаблон("%1: %2;", ЭлементМассиваОшибок.code, ЭлементМассиваОшибок.error); 
									 КонецЕсли;
								 КонецЦикла;
							 КонецЕсли; 
						 КонецЦикла;
						 
						 ОбъектыКСнятиюСРегистрации = Неопределено;
						 
						 Если МассивКодовПриВыгрузкеСОшибкой.Количество() > 0 Тогда 
							 
							 Если ВходныеПараметры.МассивДанных <> Неопределено Тогда
								 
								 Если СтруктураПодключения.ТипЗапроса = "ВыгрузкаКонтрагентов" Тогда
									 
									 Запрос = Новый Запрос;
									 Запрос.Текст = 
									 "ВЫБРАТЬ
									 |	Контрагенты.Ссылка КАК Ссылка
									 |ИЗ
									 |	Справочник.Контрагенты КАК Контрагенты
									 |ГДЕ
									 |	Контрагенты.Ссылка В(&Контрагенты)
									 |	И НЕ Контрагенты.Код В (&ОбъектыВыгруженныеСОшикой)";
									 
									 Запрос.УстановитьПараметр("Контрагенты", ВходныеПараметры.МассивДанных);
									 Запрос.УстановитьПараметр("ОбъектыВыгруженныеСОшикой", МассивКодовПриВыгрузкеСОшибкой);
									 
									 ОбъектыКСнятиюСРегистрации = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
									 
								 КонецЕсли;  
								 
								 Если СтруктураПодключения.ТипЗапроса = "ВыгрузкаАкций" Тогда
									 
									 Запрос = Новый Запрос;
									 Запрос.Текст = 
									 "ВЫБРАТЬ
									 |	УстановкаСкидокПоКонтрагентам.Ссылка КАК Ссылка
									 |ИЗ
									 |	Документ.УстановкаСкидокПоКонтрагентам КАК УстановкаСкидокПоКонтрагентам
									 |ГДЕ
									 |	УстановкаСкидокПоКонтрагентам.Ссылка В(&Документы)
									 |	И НЕ УстановкаСкидокПоКонтрагентам.Номер В (&ОбъектыВыгруженныеСОшикой)";
									 
									 Запрос.УстановитьПараметр("Документы", ВходныеПараметры.МассивДанных);
									 Запрос.УстановитьПараметр("ОбъектыВыгруженныеСОшикой", МассивКодовПриВыгрузкеСОшибкой);
									 
									 ОбъектыКСнятиюСРегистрации = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
									 
								 КонецЕсли;
								 
							 КонецЕсли;
							 
						 КонецЕсли;
						 
					 КонецЕсли;
					 
				 КонецЕсли;
	
				РезультатДанныеОчереди = Неопределено; 
				b2b_ОбменЗаявками.ЗаписатьВЖурналЗапросыНаОбновлениеВОчередиРезультат(
					ВходныеПараметры.ИдентификаторЗапроса,
					ВходныеПараметры.ИдентификаторКлиента,
					РезультатДанныеОчереди,
					"",
					Ложь,
					Истина,
					СтруктураПодключения.ХранитьПодробностиЛогирования
				);
				
				Если ОбъектыКСнятиюСРегистрации <> Неопределено И ОбъектыКСнятиюСРегистрации.Количество() > 0 Тогда
					// снимаем с регистрации контрагентов, выгруженных без ошибки
					ПланыОбмена.УдалитьРегистрациюИзменений(СтруктураПодключения.Узел, ОбъектыКСнятиюСРегистрации);
					// запись в журнал контрагентов, при выгрузке которых произошла ошибка
					Если ТекстОшибокИзСтруктурыОтвета <> "" Тогда
						ТекстОшибкиЗагрузки =  СтрШаблон("%1 %2", Структура_JSON_Ответ.data.message, ТекстОшибокИзСтруктурыОтвета);
						b2b_ОбменЗаявками.ЗаписатьОшибкуВЖурнал(
							Строка(СтруктураПодключения.ИдентификаторЗапроса),
							"Есть ошибки при отработки очереди. " + ТекстОшибкиЗагрузки,
							Структура_JSON_Ответ.requestId
						);
					КонецЕсли;
				
				КонецЕсли;
				
			 ИначеЕсли Структура_JSON_Ответ.data.result = "error" Тогда
				 
				 ТекстОшибокИзСтруктурыОтвета = "";
				 
				 Если Структура_JSON_Ответ.data.Свойство("data") Тогда
					 
					 Если ТипЗнч(Структура_JSON_Ответ.data.data) = Тип("Структура") 
						 И Структура_JSON_Ответ.data.data.Свойство("errors") Тогда 
						 
						 Если ТипЗнч(Структура_JSON_Ответ.data.data.errors) = Тип("Массив") Тогда
							 
							 МассивКодовПриВыгрузкеСОшибкой = Новый Массив;
							 
							 Для Каждого ЭлементМассиваОшибок Из Структура_JSON_Ответ.data.data.errors Цикл 
								 // для контрагентов
								 Если ЭлементМассиваОшибок.Свойство("login") Тогда
									 МассивКодовПриВыгрузкеСОшибкой.Добавить(ЭлементМассиваОшибок.login);
									 ТекстОшибокИзСтруктурыОтвета = ТекстОшибокИзСтруктурыОтвета + 
									 	СтрШаблон("%1: %2;", ЭлементМассиваОшибок.login, ЭлементМассиваОшибок.error);
								 КонецЕсли;
								 // для акций
								 Если ЭлементМассиваОшибок.Свойство("code") Тогда
									 МассивКодовПриВыгрузкеСОшибкой.Добавить(ЭлементМассиваОшибок.code);
									 ТекстОшибокИзСтруктурыОтвета = ТекстОшибокИзСтруктурыОтвета + 
									 	СтрШаблон("%1: %2;", ЭлементМассиваОшибок.code, ЭлементМассиваОшибок.error);	 
								 КонецЕсли;
							 КонецЦикла;
							 
							 Если МассивКодовПриВыгрузкеСОшибкой.Количество() > 0 Тогда
								 
								 Если СтруктураПодключения.ТипЗапроса = "ВыгрузкаКонтрагентов" Тогда
									 
									 Запрос = Новый Запрос;
									 Запрос.Текст = 
									 "ВЫБРАТЬ
									 |	Контрагенты.Ссылка КАК Ссылка
									 |ИЗ
									 |	Справочник.Контрагенты КАК Контрагенты
									 |ГДЕ
									 |	Контрагенты.Ссылка В(&Контрагенты)
									 |	И НЕ Контрагенты.Код В (&ОбъектыВыгруженныеСОшикой)";
									 
									 Запрос.УстановитьПараметр("Контрагенты", ВходныеПараметры.МассивДанных);
									 Запрос.УстановитьПараметр("ОбъектыВыгруженныеСОшикой", МассивКодовПриВыгрузкеСОшибкой);
									 
									 ОбъектыКСнятиюСРегистрации = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
								 
								 КонецЕсли;
								 
								 Если СтруктураПодключения.ТипЗапроса = "ВыгрузкаАкций" Тогда
									 
									 Запрос = Новый Запрос;
									 Запрос.Текст = 
									 "ВЫБРАТЬ
									 |	УстановкаСкидокПоКонтрагентам.Ссылка КАК Ссылка
									 |ИЗ
									 |	Документ.УстановкаСкидокПоКонтрагентам КАК УстановкаСкидокПоКонтрагентам
									 |ГДЕ
									 |	УстановкаСкидокПоКонтрагентам.Ссылка В(&Документы)
									 |	И НЕ УстановкаСкидокПоКонтрагентам.Номер В (&ОбъектыВыгруженныеСОшикой)";
									 
									 Запрос.УстановитьПараметр("Документы", ВходныеПараметры.МассивДанных);
									 Запрос.УстановитьПараметр("ОбъектыВыгруженныеСОшикой", МассивКодовПриВыгрузкеСОшибкой);
									 
									 ОбъектыКСнятиюСРегистрации = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
									 
								 КонецЕсли;
								 
								 Если ОбъектыКСнятиюСРегистрации.Количество() > 0 Тогда
									 ПланыОбмена.УдалитьРегистрациюИзменений(СтруктураПодключения.Узел, ОбъектыКСнятиюСРегистрации);
								 КонецЕсли;
							 КонецЕсли; 
							 
						 КонецЕсли;
						 
					 КонецЕсли;
					 
				 КонецЕсли;
				 
				 ТекстОшибкиЗагрузки =  СтрШаблон("%1 %2", Структура_JSON_Ответ.data.message, ТекстОшибокИзСтруктурыОтвета);
				 РезультатДанныеОчереди = Неопределено; 
				 b2b_ОбменЗаявками.ЗаписатьВЖурналЗапросыНаОбновлениеВОчередиРезультат(
				 	ВходныеПараметры.ИдентификаторЗапроса,
					ВходныеПараметры.ИдентификаторКлиента,
					РезультатДанныеОчереди,
					"Ошибка отработки очереди. " + ТекстОшибкиЗагрузки,
					Истина,
					,
					СтруктураПодключения.ХранитьПодробностиЛогирования
				 );
				 b2b_ОбменЗаявками.ЗаписатьОшибкуВЖурнал(
				 	Строка(СтруктураПодключения.ИдентификаторЗапроса),
					"Ошибка отработки очереди. " + ТекстОшибкиЗагрузки,
					Структура_JSON_Ответ.requestId
				 );
			 Иначе 
				 РезультатДанныеОчереди = Неопределено; 
				 b2b_ОбменЗаявками.ЗаписатьВЖурналЗапросыНаОбновлениеВОчередиРезультат(
				 	ВходныеПараметры.ИдентификаторЗапроса,
					ВходныеПараметры.ИдентификаторКлиента,
					РезультатДанныеОчереди,
					"Нераспознанный результат",
					Истина,
					,
					СтруктураПодключения.ХранитьПодробностиЛогирования
				 );
				 b2b_ОбменЗаявками.ЗаписатьОшибкуВЖурнал(
				 	Строка(СтруктураПодключения.ИдентификаторЗапроса),
					"Ошибка отработки очереди",
					Структура_JSON_Ответ.requestId);
			 КонецЕсли;
			
		Иначе 
						
			РезультатДанные = Новый Структура("РезультатJson,ИдентификаторОчереди", , ""); 			
			РезультатДанные.РезультатJson = Структура_JSON_Ответ;
			b2b_ОбменЗаявками.ЗаписатьВЖурналЗапросыНаОбновлениеВОчередиРезультат(
				Строка(СтруктураПодключения.ИдентификаторЗапроса),
				ИдентификаторКлиента,
				РезультатДанные,
				"Ответ по структуре не соответствует ожидаемой",
				Истина,
				,
				СтруктураПодключения.ХранитьПодробностиЛогирования
			);

		КонецЕсли;
		
		РезультатОтправки = Истина;
	Иначе 
		//запись в журнал
		b2b_ОбменЗаявками.ЗаписатьВЖурналЗапросыНаОбновлениеВОчереди(
			Строка(СтруктураПодключения.ИдентификаторЗапроса),
			"", 
			ТекстЗапроса, 
			ВходныеПараметры,
			СтруктураПодключения.ХранитьПодробностиЛогирования
		);
		
		КодОшибки = Ответ_АПИ.КодСостояния;
		
		Если КодОшибки = 400
			ИЛИ КодОшибки = 403 Тогда   		
			
			ИнформацияОбОшибке = СтрокаJSONОтвета;
			
		ИначеЕсли КодОшибки = 401 Тогда
			
			ИнформацияОбОшибке = "Авторизация не пройдена"; 
		Иначе 
			
			ИнформацияОбОшибке = "Ошибка сервера";
		КонецЕсли;
		
		Комментарий = СтрШаблон("%1:%2", Строка(КодОшибки), ИнформацияОбОшибке); 
		
		РезультатДанные = Новый Структура("РезультатJson,ИдентификаторОчереди",,""); 
		РезультатДанные.РезультатJson = СтрокаJSONОтвета; 
		
		b2b_ОбменЗаявками.ЗаписатьВЖурналЗапросыНаОбновлениеВОчередиРезультат(
			Строка(СтруктураПодключения.ИдентификаторЗапроса),
			"",
			РезультатДанные,
			Комментарий,
			Истина,
			,
			СтруктураПодключения.ХранитьПодробностиЛогирования
		);
		
		ТекстОшибки = "Не удалось отправить запрос на отработку очереди по остаткам ЦО из SNL." + ИнформацияОбОшибке;
		МассивОшибок.Добавить(ТекстОшибки);
		
	КонецЕсли;
	
КонецПроцедуры // ОтправкаПодтвержденияДоЗаказа()

Функция ПолучитьПараметрыМетодаВыгрузкиКонтрагентов()
	
КонецФункции

Процедура b2b_ВыгрузитьКонтрагентовИОбработатьОчередь(Ключ) Экспорт
	Обработка = Обработки.b2b_ОбменДанныхПоAPI.Создать();
	Обработка.ВыполнитьВыгрузкуКонтрагентов(Истина, Истина);
КонецПроцедуры

Процедура b2b_ВыгрузитьАкцииИОбработатьОчередь(Ключ) Экспорт
	Обработка = Обработки.b2b_ОбменДанныхПоAPI.Создать();
	Обработка.ВыполнитьВыгрузкуАкций(Истина, Истина);
КонецПроцедуры

Процедура b2b_ВыгрузитьКонтрагентовИОбработатьОчередьПолная(Ключ) Экспорт
	Обработка = Обработки.b2b_ОбменДанныхПоAPI.Создать();
	Обработка.ВыполнитьВыгрузкуКонтрагентов(Истина, Истина, Истина);
КонецПроцедуры

Процедура b2b_ВыгрузитьАкцииИОбработатьОчередьПолная(Ключ) Экспорт
	Обработка = Обработки.b2b_ОбменДанныхПоAPI.Создать();
	Обработка.ВыполнитьВыгрузкуАкций(Истина, Истина, Истина);
КонецПроцедуры

Процедура ЗаписатьВЖурналЗапросыНаОбновлениеВОчередиПоAPI(
		ИдентификаторЗапроса,
		ИдентификаторКлиента,
		Запрос,
		ВходныеПараметры,
		ХранитьПодробностиЛогирования = Ложь
	) Экспорт

	МенеджерЗаписи = РегистрыСведений.b2b_ЗапросыНаОбновлениеВОчереди.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДатаСеанса(); 
	МенеджерЗаписи.ИдентификаторЗапроса = ИдентификаторЗапроса; 
	МенеджерЗаписи.ИдентификаторКлиента = ИдентификаторКлиента;
	Если ХранитьПодробностиЛогирования Тогда
	
		МенеджерЗаписи.Запрос = Новый ХранилищеЗначения(Запрос, Новый СжатиеДанных(9));	
	
	КонецЕсли;
	
	//Если ВходныеПараметры.Свойство("СписокКонтрагентов") Тогда
	//	
	//	МенеджерЗаписи.МассивДанных = ВходныеПараметры.СписокКонтрагентов;
	//	
	//КонецЕсли;
	
	Если ВходныеПараметры.Свойство("ИдентификаторОчереди") Тогда
	
		МенеджерЗаписи.ИдентификаторОчереди = ВходныеПараметры.ИдентификаторОчереди; 	
	
	КонецЕсли;       
		
	Если ВходныеПараметры.Свойство("ТипЗапроса") Тогда
	
		МенеджерЗаписи.ТипЗапроса = ВходныеПараметры.ТипЗапроса; 	
	
	КонецЕсли;
	
	b2b_ОбменЗаявками.ПопыткаЗаписиВЖурнал( МенеджерЗаписи, "b2b_ЗапросыНаОбновлениеИстория", ИдентификаторЗапроса); 

КонецПроцедуры //  

Функция ПолучитьВсеИзмененияИзПланаОбмена(УзелПланаОбмена, ИмяОбъектаМетаданных = "") Экспорт
	
	Если ИмяОбъектаМетаданных = "" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура("Данные, НомерСообщения", Новый Массив());
	
	Если НЕ ЗначениеЗаполнено(УзелПланаОбмена) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не (УзелПланаОбмена.Код = "B2B" Или УзелПланаОбмена.Код = "KNT") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку();
	
	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	ЗаписьСообщения.НачатьЗапись(ЗаписьXML, УзелПланаОбмена);
	
	СтруктураВозврата.НомерСообщения = ЗаписьСообщения.НомерСообщения;
	
	Выборка = ПланыОбмена.ВыбратьИзменения(ЗаписьСообщения.Получатель, ЗаписьСообщения.НомерСообщения); 
	
	Пока Выборка.Следующий() Цикл
		
		Данные = Выборка.Получить();

		Если ИмяОбъектаМетаданных = "Контрагенты" И ТипЗнч(Данные) = Тип("СправочникОбъект.Контрагенты") Тогда
			
			СтруктураВозврата.Данные.Добавить(Данные.Ссылка);	
			
		КонецЕсли;
		
		Если ИмяОбъектаМетаданных = "УстановкаСкидокПоКонтрагентам" 
			И ТипЗнч(Данные) = Тип("ДокументОбъект.УстановкаСкидокПоКонтрагентам") Тогда
			
			СтруктураВозврата.Данные.Добавить(Данные.Ссылка);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтруктураВозврата; 
	
КонецФункции

#КонецОбласти 

//Данилова Е.В. 23.07.2025 HELP-6121 
#Область Пауза
Процедура Пауза(Секунд) Экспорт
	
	ТекущийСеансИнформационнойБазы = ПолучитьТекущийСеансИнформационнойБазы();
	ФоновоеЗадание = ТекущийСеансИнформационнойБазы.ПолучитьФоновоеЗадание();
	
	Если ФоновоеЗадание = Неопределено Тогда
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Ошибка выполнения'"), 
			УровеньЖурналаРегистрации.Ошибка, 
			, 
			, 
			НСтр("ru = 'b2b_ОбменДаннымиПоAPI.Пауза() разрешается использовать только в фоновом задании.'"));
		Параметры = Новый Массив;
		Параметры.Добавить(Секунд);
		ФоновоеЗадание = ФоновыеЗадания.Выполнить("b2b_ОбменДаннымиПоAPI.Пауза", Параметры);
	КонецЕсли;
		
	ФоновоеЗадание.ОжидатьЗавершенияВыполнения(Секунд);
	
КонецПроцедуры	
#КонецОбласти  

//++Данилова Е.В. 23.07.2025 HELP-6121
#Область АкцииПоКонтрагентам

Процедура ЗапуститьВФонеОтправкуАкцииНаПорталb2b(Знач Версия, Знач ДокРегистрации, Знач ИдентификаторФЗ) Экспорт
			
	МассивПараметров = Новый Массив; 
	МассивПараметров.Добавить(Версия);
	МассивПараметров.Добавить(ДокРегистрации);
	
	ФЗ = ФоновыеЗадания.Выполнить("b2b_ОбменДаннымиПоAPI.ЗаписатьВФонеДанныеПоАкцииДляОтправки",МассивПараметров,ИдентификаторФЗ,"ЗаписатьВФонеДанныеПоАкцииДляОтправки"); 
	
КонецПроцедуры  


Процедура ЗаписатьВФонеДанныеПоАкцииДляОтправки(Знач ВерсияСтарая,Знач ДокументРегистрации) экспорт 
	
	ДокЗаписан = Ложь; 
	ПроверкаВерсииДокументаПриЗаписи(ВерсияСтарая,Документрегистрации,ДокЗаписан);
	
	Если ДокЗаписан Тогда
		
		ЗаписатьДанныеПоАкцииВРегистрДляПередачи(ДокументРегистрации); 
		
		ОтправитьДанныеПоАкциямПоИзмененнымДанным(); 
	Иначе 
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Ошибка выполнения в фоне отправки по апи b2b даннных по акции'"), 
			УровеньЖурналаРегистрации.Ошибка, 
			, 
			, 
			НСтр("ru = 'Ошибка в ""ЗаписатьВФонеДанныеПоАкцииДляОтправки"".'"));
 
		
	КонецЕсли;

КонецПроцедуры 

Процедура ОтправитьДанныеПоАкциямПоИзмененнымДанным()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	b2b_ПереданныеАкцииКонтрагентов.ДокументРегистрации КАК ДокументРегистрации
		|ИЗ
		|	РегистрСведений.b2b_ПереданныеАкцииКонтрагентов КАК b2b_ПереданныеАкцииКонтрагентов
		|ГДЕ
		|	b2b_ПереданныеАкцииКонтрагентов.Изменен";
	
	МассивДляВыгрузки =  Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДокументРегистрации"); 
	
	Если МассивДляВыгрузки.Количество() > 0 Тогда 
		
		ОбработкаОб = Обработки.b2b_ОбменДанныхПоAPI.Создать();
		
		ТипЗапроса = "ВыгрузкаАкций";
		СтруктураПодключения = b2b_ОбменДаннымиПоAPI.ПолучитьСтруктуруПодключения();
		СтруктураПодключения.Вставить("ТипЗапроса", ТипЗапроса);
		СтруктураПодключения.Вставить("ПолнаяВыгрузка", ложь);
		СтруктураПодключения.Вставить("Данные", МассивДляВыгрузки);
		
		СтруктураДляВыгрузкиАкций = ОбработкаОб.ПолучитьСтруктуруДляВыгрузкиАкций(СтруктураПодключения);
		
		РезультатОтправки = Ложь;  	
	    ОбработкаОб.ОтправитьВыгружаемыеДанныеНаПорталПоAPI(СтруктураПодключения,СтруктураДляВыгрузкиАкций,РезультатОтправки); 
		Если РезультатОтправки = Истина Тогда
			
			Для каждого ДокОтправки  Из МассивДляВыгрузки Цикл
				
				МенеджерЗаписи = РегистрыСведений.b2b_ПереданныеАкцииКонтрагентов.СоздатьМенеджерЗаписи();  
				МенеджерЗаписи.ДокументРегистрации = ДокОтправки;  
				МенеджерЗаписи.Прочитать();
				
				МенеджерЗаписи.ПереданныеДанные = МенеджерЗаписи.ДанныеБазы; 
				МенеджерЗаписи.Изменен = Ложь;
				МенеджерЗаписи.ДатаОтправки = ТекущаяДатаСеанса(); 
				МенеджерЗаписи.Записать(); 
				
			КонецЦикла;	
			
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры



Процедура ПроверкаВерсииДокументаПриЗаписи(Знач ВерсияСтарая,Знач ДокументРегистрации,ДокЗаписан,СекундПауза = 0) Экспорт 
	
	Если СекундПауза >= 300 Тогда 
		
		ДокЗаписан = Ложь;	
		
	ИначеЕсли ВерсияСтарая = ДокументРегистрации.ссылка.ВерсияДанных Тогда 
		
		Пауза(10);
		
		СекундПауза = СекундПауза + 10; 
		
		ПроверкаВерсииДокументаПриЗаписи(ВерсияСтарая,ДокументРегистрации,ДокЗаписан,СекундПауза); 
	Иначе 
		ДокЗаписан = истина;  
	КонецЕсли;

КонецПроцедуры


Процедура ЗаписатьДанныеПоАкцииВРегистрДляПередачи(Знач ДокументРегистрации) Экспорт 
	
	//прежде чем записывать, необходимо, что
	
	НаборЗаписей = РегистрыСведений.b2b_ПереданныеАкцииКонтрагентов.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.ДокументРегистрации.Установить(ДокументРегистрации.ссылка); 
	НаборЗаписей.Прочитать();
	
	
	ДанныеАкции = ЗаполнитьСтруктуруДанныхПоАкции(ДокументРегистрации); 
	
	Если НаборЗаписей.Количество() > 0  Тогда
		МенеджерЗаписи = НаборЗаписей[0];
		
		ПереданныеДанные = МенеджерЗаписи.ПереданныеДанные.Получить(); 
		РезультатСравнения = РезультатСравненияСпереданнымиАкциямиНаПортал(ДанныеАкции,ПереданныеДанные);
		
		СтруктураИзменений = Новый Структура; 
		СтруктураИзменений.Вставить("ИзмененаШапка",РезультатСравнения.ИзмененаШапка); 
		СтруктураИзменений.Вставить("ИзмененыТовары",РезультатСравнения.ИзмененыТовары);
		СтруктураИзменений.Вставить("ИзмененыКонтрагенты",РезультатСравнения.ИзмененыКонтрагенты);
		СтруктураИзменений.Вставить("КонтрагентыИзмененные",РезультатСравнения.МассивИзмКонтрагентов);
		
		МенеджерЗаписи.ДанныеБазы = Новый ХранилищеЗначения(ДанныеАкции,Новый СжатиеДанных(9));
		
		Если НЕ РезультатСравнения.ИзмененаШапка
			И НЕ РезультатСравнения.ИзмененыТовары
			И НЕ РезультатСравнения.ИзмененыКонтрагенты Тогда
			
			НаборЗаписей.Записать();
			
			Возврат; 	
		Иначе 						 
			
			МенеджерЗаписи.Изменения = Новый ХранилищеЗначения(СтруктураИзменений,Новый СжатиеДанных(9)); 
			МенеджерЗаписи.Изменен = Истина; 
			МенеджерЗаписи.ДатаИзменения = ТекущаяДатаСеанса(); 
			НаборЗаписей.Записать(); 
		КонецЕсли;
		
		 
		
	Иначе 
		
		
		СтруктураИзменений = Новый Структура; 
		СтруктураИзменений.Вставить("ИзмененаШапка",истина); 
		СтруктураИзменений.Вставить("ИзмененыТовары",истина);
		СтруктураИзменений.Вставить("ИзмененыКонтрагенты",истина);
		СтруктураИзменений.Вставить("КонтрагентыИзмененные","Все");
		
		МенеджерЗаписи = РегистрыСведений.b2b_ПереданныеАкцииКонтрагентов.СоздатьМенеджерЗаписи(); 
		МенеджерЗаписи.ДокументРегистрации = ДокументРегистрации.ссылка; 
		МенеджерЗаписи.ДанныеБазы = Новый ХранилищеЗначения(ДанныеАкции,Новый СжатиеДанных(9));  
		МенеджерЗаписи.Изменен = Истина;
		МенеджерЗаписи.Изменения = Новый ХранилищеЗначения(СтруктураИзменений,Новый СжатиеДанных(9));
		МенеджерЗаписи.ДатаИзменения = ТекущаяДатаСеанса();
		МенеджерЗаписи.Записать(); 
		
	КонецЕсли;
	
КонецПроцедуры

Функция РезультатСравненияСпереданнымиАкциямиНаПортал(ДанныеБазы,ПереданныеДанные)

	 //перебором, чтобы получить, что изменилось 
	 // 
	 ИзмененаШапка = Ложь; 
	 ИзмененыТовары = Ложь;
	 ИзмененыКонтрагенты = Ложь; 
	 
	 ИзмененныеКонтрагенты = Новый Массив; 
	 
	 Если  ТипЗнч(ПереданныеДанные) = Тип("Структура") Тогда 	 
		 
		 //еще сравнить массивы по контрагентам точечно  
		 
		 Для каждого ЭлементСтруктуры Из ДанныеБазы Цикл
			 
			 Если типЗнч(ЭлементСтруктуры.Значение) = Тип("Массив") Тогда
				 
				 
				 МассивПереданныхДанных = ПереданныеДанные[ЭлементСтруктуры.Ключ];
				 МассивДанныхБазы = ЭлементСтруктуры.Значение; 
				 
				 СтрокаПереданные = ЗначениеВСтрокуВнутр(МассивПереданныхДанных);  
				 СтрокаДанныеБазы = ЗначениеВСтрокуВнутр(МассивДанныхБазы);
					
				 Если ЭлементСтруктуры.Ключ = "products" Тогда 					
					
					Если СтрокаПереданные <> СтрокаДанныеБазы Тогда
					
						ИзмененыТовары = Истина; 	
					
					КонецЕсли;
					
				КонецЕсли;
				
				Если ЭлементСтруктуры.Ключ = "distributors" Тогда
					
					Если СтрокаПереданные <> СтрокаДанныеБазы Тогда
					
						ИзмененыКонтрагенты = Истина; 
						
						//поточечно
						
						СоответствиеКонтрагентыБазы = Новый Соответствие; 
						СоответствиеКонтрагентыПереданные = Новый Соответствие; 
						
						Для каждого ЭлементМассива Из МассивПереданныхДанных Цикл
							
							СоответствиеКонтрагентыПереданные.Вставить(ЭлементМассива.distr,ЭлементМассива.active); 
							
						КонецЦикла;
						
						Для каждого ЭлементМассива Из МассивДанныхБазы Цикл
							
							СоответствиеКонтрагентыБазы.Вставить(ЭлементМассива.distr,ЭлементМассива.active); 
							
						КонецЦикла; 
						
						Для каждого ЭлементСоотКонтр Из СоответствиеКонтрагентыБазы Цикл
							
							Если СоответствиеКонтрагентыПереданные.Получить(ЭлементСоотКонтр.Ключ) = неопределено
								ИЛИ СоответствиеКонтрагентыПереданные.Получить(ЭлементСоотКонтр.Ключ) <> ЭлементСоотКонтр.Значение Тогда
								
								ИзмененныеКонтрагенты.Добавить(ЭлементСоотКонтр.Ключ); 	
								
							КонецЕсли;
							
						КонецЦикла; 
						
						
						Для каждого ЭлементСоотКонтр Из СоответствиеКонтрагентыПереданные Цикл
							
							Если СоответствиеКонтрагентыБазы.Получить(ЭлементСоотКонтр.Ключ) = неопределено
								ИЛИ СоответствиеКонтрагентыБазы.Получить(ЭлементСоотКонтр.Ключ) <> ЭлементСоотКонтр.Значение Тогда
								
								Если ИзмененныеКонтрагенты.Найти(ЭлементСоотКонтр.Ключ) = неопределено Тогда
									
									ИзмененныеКонтрагенты.Добавить(ЭлементСоотКонтр.Ключ);	
									
								КонецЕсли;
								
								
							КонецЕсли;
							
						КонецЦикла;

					
					КонецЕсли;
					
				КонецЕсли;
				
				 				 
			 Иначе 
				 Если НЕ ПереданныеДанные.Свойство(ЭлементСтруктуры.Ключ) 
					 ИЛИ ПереданныеДанные[ЭлементСтруктуры.Ключ] <> ЭлементСтруктуры.Значение Тогда
					 
					 ИзмененаШапка = Истина; 
					 
				 КонецЕсли;
			 КонецЕсли;
			 
		 КонецЦикла;
	 Иначе
		 
		 ИзмененаШапка = истина; 
		 ИзмененыТовары = истина;
		 ИзмененыКонтрагенты = Истина; 
		  
	 КонецЕсли;
	 
	 Возврат Новый Структура("ИзмененаШапка,ИзмененыТовары,ИзмененыКонтрагенты,МассивИзмКонтрагентов",ИзмененаШапка,ИзмененыТовары,ИзмененыКонтрагенты,ИзмененныеКонтрагенты); 
КонецФункции // СравнитьСпереданнымиАкциямиНаПортал()


Функция ЗаполнитьСтруктуруДанныхПоАкции(Знач ДокументРегистрации)

	Запрос = Новый Запрос; 	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановкаСкидокПоКонтрагентам.Ссылка КАК Ссылка,
		|	УстановкаСкидокПоКонтрагентам.Номер КАК Номер,
		|	УстановкаСкидокПоКонтрагентамСкидки.Номенклатура КАК Номенклатура,
		|	УстановкаСкидокПоКонтрагентамСкидки.Скидка КАК Скидка,
		|	УстановкаСкидокПоКонтрагентамСкидки.СкидкаКонечныйПокупатель КАК СкидкаКонечныйПокупатель,
		|	ВЫРАЗИТЬ(УстановкаСкидокПоКонтрагентам.Комментарий КАК СТРОКА(100)) КАК Наименование,
		|	УстановкаСкидокПоКонтрагентам.Дата КАК ДатаНачала,
		|	УстановкаСкидокПоКонтрагентам.Дата2 КАК ДатаОкончания
		|ПОМЕСТИТЬ втДанные
		|ИЗ
		|	Документ.УстановкаСкидокПоКонтрагентам КАК УстановкаСкидокПоКонтрагентам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УстановкаСкидокПоКонтрагентам.Скидки КАК УстановкаСкидокПоКонтрагентамСкидки
		|		ПО УстановкаСкидокПоКонтрагентам.Ссылка = УстановкаСкидокПоКонтрагентамСкидки.Ссылка
		|ГДЕ
		|	УстановкаСкидокПоКонтрагентам.Проведен
		|	И УстановкаСкидокПоКонтрагентам.Ссылка = &ДокументРегистрации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НоменклатураГруппа.Код КАК КодМодели,
		|	втДанные.Скидка КАК Скидка,
		|	втДанные.СкидкаКонечныйПокупатель КАК СкидкаКонечныйПокупатель,
		|	втДанные.Номер КАК Номер,
		|	втДанные.Наименование КАК Наименование,
		|	НАЧАЛОПЕРИОДА(втДанные.ДатаНачала, ДЕНЬ) КАК ДатаНачала,
		|	КОНЕЦПЕРИОДА(втДанные.ДатаОкончания, ДЕНЬ) КАК ДатаОкончания
		|ИЗ
		|	Справочник.Номенклатура КАК СпрНоменлатура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураГруппа
		|		ПО СпрНоменлатура.Родитель = НоменклатураГруппа.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДанные КАК втДанные
		|		ПО (СпрНоменлатура.Ссылка В ИЕРАРХИИ
		|				(ВЫБРАТЬ
		|					втДанные.Номенклатура КАК Номенклатура
		|				ИЗ
		|					втДанные КАК втДанные))
		|ГДЕ
		|	СпрНоменлатура.ПометкаУдаления = ЛОЖЬ
		|	И СпрНоменлатура.ЭтоГруппа = ЛОЖЬ
		|	И ВЫБОР
		|			КОГДА СпрНоменлатура.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
		|				ТОГДА ""Да""
		|			КОГДА СпрНоменлатура.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
		|				ТОГДА ""Нет""
		|			ИНАЧЕ ВЫБОР
		|					КОГДА СпрНоменлатура.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
		|						ТОГДА ""Да""
		|					КОГДА СпрНоменлатура.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
		|						ТОГДА ""Нет""
		|					ИНАЧЕ ВЫБОР
		|							КОГДА СпрНоменлатура.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
		|								ТОГДА ""Да""
		|							КОГДА СпрНоменлатура.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
		|								ТОГДА ""Нет""
		|							ИНАЧЕ ВЫБОР
		|									КОГДА СпрНоменлатура.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
		|										ТОГДА ""Да""
		|									КОГДА СпрНоменлатура.Родитель.Родитель.Родитель.Родитель.ВыгружатьВИнтернетМагазин.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.НЕт)
		|										ТОГДА ""Нет""
		|									ИНАЧЕ ""Нет""
		|								КОНЕЦ
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ = ""Да""
		|ИТОГИ
		|	МАКСИМУМ(Наименование),
		|	МАКСИМУМ(ДатаНачала),
		|	МАКСИМУМ(ДатаОкончания)
		|ПО
		|	Номер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Ведущие.Код КАК КодКонтрагента,
		|	УстановкаСкидокПоКонтрагентамКонтрагенты.Согласован КАК УчавствуетВАкции,
		|	втДанные.Номер КАК Номер
		|ИЗ
		|	втДанные КАК втДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УстановкаСкидокПоКонтрагентам.Контрагенты КАК УстановкаСкидокПоКонтрагентамКонтрагенты
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Ведущие
		|				ПО Контрагенты.Ведущий = Ведущие.Ссылка
		|			ПО УстановкаСкидокПоКонтрагентамКонтрагенты.Контрагент = Контрагенты.Ссылка
		|		ПО втДанные.Ссылка = УстановкаСкидокПоКонтрагентамКонтрагенты.Ссылка
		|ГДЕ
		|	Ведущие.ВыгружатьВИнтернетМагазин = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)"; 
	
	Запрос.УстановитьПараметр("ДокументРегистрации",ДокументРегистрации.ссылка); 
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаАкции = РезультатЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаКонтрагенты = РезультатЗапроса[2].Выбрать(); 
	
	ДанныеШапки = СтруктураДанныхПоАкции();
	
	Если ВыборкаАкции.Следующий() Тогда  		 
		
		ДанныеШапки.code = ВыборкаАкции.Номер;
		ДанныеШапки.name =  ВыборкаАкции.Наименование;
		ДанныеШапки.startDate = ВыборкаАкции.ДатаНачала;
		ДанныеШапки.endDate = ВыборкаАкции.ДатаОкончания;
		
		ВыборкаСкидки = ВыборкаАкции.Выбрать();
		
		МассивНоменклатуры = Новый Массив;
		
		Пока ВыборкаСкидки.Следующий() Цикл
			
			Если ЗначениеЗаполнено(ВыборкаСкидки.КодМодели) Тогда
				
				СтруктураТоваров = СтруктураДанныхПоТоварамАкции(); 
				СтруктураТоваров.code = ВыборкаСкидки.КодМодели;
				СтруктураТоваров.discountDistr = ВыборкаСкидки.Скидка;
				СтруктураТоваров.discountClient = ВыборкаСкидки.СкидкаКонечныйПокупатель; 
				
				МассивНоменклатуры.Добавить(СтруктураТоваров);
			КонецЕсли;
			
		КонецЦикла;
		
		ДанныеШапки.products = МассивНоменклатуры; //всегда добавляем, для сравнения 
		
		МассивКонтрагентов = Новый Массив;
		
		Пока ВыборкаКонтрагенты.Следующий() Цикл
			
			Если ВыборкаКонтрагенты.Номер = ВыборкаАкции.Номер Тогда
				
				Если ЗначениеЗаполнено(ВыборкаКонтрагенты.КодКонтрагента) Тогда
					СтруктураКонтрагента = СтруктураДанныхПоКонтрагентамАкции();
					СтруктураКонтрагента.distr = ВыборкаКонтрагенты.КодКонтрагента; 
					СтруктураКонтрагента.active = ВыборкаКонтрагенты.УчавствуетВАкции;
					МассивКонтрагентов.Добавить(СтруктураКонтрагента);	
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ДанныеШапки.distributors = МассивКонтрагентов;
			
	КонецЕсли;
	
    Возврат ДанныеШапки; 
	
КонецФункции // ЗаполнитьСтруктуруДанныхПоАкции()


Функция СтруктураДанныхПоАкции() 
	
	ДанныеШапки = Новый Структура; 
	ДанныеШапки.Вставить("code","");
	ДанныеШапки.Вставить("name","");
	ДанныеШапки.Вставить("startDate",Дата(1,1,1));
	ДанныеШапки.Вставить("endDate",Дата(1,1,1));
	ДанныеШапки.Вставить("products",Новый Массив);  
	ДанныеШапки.Вставить("distributors",Новый Массив); 
	
	Возврат ДанныеШапки; 

КонецФункции // СтруктураДанныхПоАкциям()

Функция СтруктураДанныхПоТоварамАкции()
	
	ДанныеПоТовару = Новый Структура; 
	ДанныеПоТовару.Вставить("code");
	ДанныеПоТовару.Вставить("discountDistr");
	ДанныеПоТовару.Вставить("discountClient");
	
	Возврат ДанныеПоТовару; 
	
КонецФункции // СтруктураДанныхПоТоварамАкции() 


Функция СтруктураДанныхПоКонтрагентамАкции()
	
	ДанныеПоТовару = Новый Структура; 
	ДанныеПоТовару.Вставить("distr");
	ДанныеПоТовару.Вставить("active"); 
	
	Возврат ДанныеПоТовару; 
	
КонецФункции



	
#КонецОбласти
